<?php
$x = rand(360, 410)/10;
// $x = 37.7;
// if ($x < 37.7){
//     echo"<p style = \" color: green;\">Здоров! Температура: </p>".$x;
// }
// if ($x == 37.7){
//     echo"<p style = \" color: orange;\">Что-то нездоровится… Температура: </p>".$x;
// }
// if ($x > 37.7){
//     echo"<p style = \" color: red;\">Болен! Температура: </p>".$x;
// }
echo ($x < 37.7 ? "<p style = \" color: green;\">Здоров! Температура: </p>".$x : $x == 37.7 ? "<p style = \" color: orange;\">Что-то нездоровится… Температура: </p>".$x :  "<p style = \" color: red;\">Болен! Температура: </p>".$x);
?>